/* Задача 64: Задайте значение N. Напишите программу,
которая выведет все натуральные числа в промежутке от N до 1.

N = 5 -> "5, 4, 3, 2, 1"
N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"                     */

int n = new Random().Next(1, 25);
Console.WriteLine($"N = {n}\n");

for (int i = 0; i < n; n -= 1)
{
    Console.Write($"{n} ");
}